wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverI2c.c
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Transmitter );
        
        /* wait till address gets sent and the direction bit is sent and */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        if ( result == kNoErr )
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    /* configure dma tx channel for i2c */
    i2c_dma_config_and_execute( device, message, true );
    
    /* wait till the byte is actually sent from the i2c peripheral */
    counter = 1000;
    while ( I2C_GetFlagStatus( i2c_mapping[device->port].i2c, I2C_FLAG_BTF ) == RESET )
    {
      --counter;
      if ( counter == 0 )
      {
        return kGeneralErr;
      }
    }
    
    /* generate start condition again and address a device in read mode */
    /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
    for ( i = 0; i < message->retries; i++ )
    {
      /* generate a start condition */
      I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );
      
      /* wait till start condition is generated and the bus becomes free */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return kTimeoutErr;
      }
      
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Receiver );
        
        /* wait till address gets sent and the direction bit is sent and */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        if ( result == kNoErr )
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    /* receive data from the slave device */
    if ( message->rx_length == 1 )
    {
      /* disable acknowledgement before we start receiving bytes, this is a single byte transmission */
      I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
    }
    else
    {
      /* enable acknowledgement before we start receiving bytes, this is a single byte transmission */
      I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
    }
    
    /* start dma which will read bytes */
    i2c_dma_config_and_execute( device, message, false );
    /* maybe we will have to wait on the BTF flag!!! */
  }
  else
  {
    
    /* read or write transaction */
    
    /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
    for ( i = 0; i < message->retries; i++ )
    {
      /* generate a start condition */
      I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );
      
      /* wait till start condition is generated and the bus becomes free */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return kTimeoutErr;
      }
      
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), ( ( message->tx_buffer ) ? I2C_Direction_Transmitter : I2C_Direction_Receiver ) );
        
        /* wait till address gets sent and the direction bit is sent */
        if ( message->tx_buffer )
        {
          result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        }
        else
        {
          result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        }
        
        if ( result == kNoErr )
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    if ( message->tx_buffer )
    {
      /* write transaction */
      /* configure dma tx channel for i2c */
      i2c_dma_config_and_execute( device, message, true );
      
      /* wait till the byte is actually sent from the i2c peripheral */
      counter = 1000;
      while ( I2C_GetFlagStatus( i2c_mapping[device->port].i2c, I2C_FLAG_BTF ) == RESET )
      {
        --counter;
        if ( counter == 0 )
        {
          return kGeneralErr;
        }
      }
    }
    else
    {
      /* read transaction */
      if ( message->rx_length == 1 )
      {
        /* disable acknowledgement before we are going to receive a single byte */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
      }
      else
      {
        /* enable acknowledgement before we start receiving multiple bytes */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
      }
      
      /* start dma which will read bytes */
      i2c_dma_config_and_execute( device, message, false );
      
      /* wait til the last byte is received */
      counter = 1000;
      while ( I2C_GetFlagStatus( i2c_mapping[device->port].i2c, I2C_FLAG_BTF ) == RESET )
      {
        --counter;
        if ( counter == 0 )
        {
          return kGeneralErr;
        }
      }
    }
  }
  
  /* generate a stop condition */
  I2C_GenerateSTOP( i2c_mapping[device->port].i2c, ENABLE );
  return kNoErr;
}
#else

