wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverI2c.c
static OSStatus i2c_transfer_message_no_dma( mico_i2c_device_t* device, mico_i2c_message_t* message )
{
  OSStatus       result;
  int            i = 0;
  
  if ( message->combined == true )
  {
    const char* tmp_ptr;
    uint8_t*    tmp_rd_ptr;
    
    /* combined transaction case, please refer to Philips I2C document to have an understanding of a combined fragment */
    
    /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
    for ( i = 0; i < message->retries; i++ )
    {
      /* generate a start condition and address a device in write mode */
      I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );
      
      /* wait till start condition is generated and the bus becomes free */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return kTimeoutErr;
      }
      
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Transmitter );
        
        /* wait till address gets sent and the direction bit is sent and */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        if ( result == kNoErr )
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    tmp_ptr = (const char*) message->tx_buffer;
    
    /* send data to the i2c device */
    for ( i = 0; i < message->tx_length; i++ )
    {
      I2C_SendData( i2c_mapping[device->port].i2c, (uint8_t) tmp_ptr[i] );
      
      /* wait till it actually gets transferred and acknowledged */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return result;
      }
    }
    
    /* generate start condition again and address a device in read mode */
    /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
    for ( i = 0; i < message->retries; i++ )
    {
      /* generate a start condition */
      I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );
      
      /* wait till start condition is generated and the bus becomes free */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return kTimeoutErr;
      }
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Receiver );
        
        /* wait till address gets sent and the direction bit is sent and */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        if ( result != kNoErr )
        {
          /* keep on pinging, if a device doesnt respond */
          continue;
        }
        else
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    /* receive data from the slave device */
    if ( message->rx_length == 1 )
    {
      /* disable acknowledgement before we start receiving bytes, this is a single byte transmission */
      I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
    }
    else
    {
      /* enable acknowledgement before we start receiving bytes, this is a single byte transmission */
      I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
    }
    tmp_rd_ptr = (uint8_t*) message->rx_buffer;
    /* start reading bytes */
    for ( i = 0; i < message->rx_length; i++ )
    {
      /* wait till something is in the i2c data register */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_RECEIVED, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return result;
      }
      
      /* get data */
      tmp_rd_ptr[i] = I2C_ReceiveData( i2c_mapping[device->port].i2c );
      if ( i == ( message->rx_length - 1 ) )
      {
        /* setup NACK for the last byte to be received */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
      }
      else
      {
        /* setup an acknowledgement beforehand for every byte that is to be received */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
      }
    }
  }
  else
  {
    
    /* read or write transaction */
    
    /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
    for ( i = 0; i < message->retries; i++ )
    {
      /* generate a start condition */
      I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );
      
      /* wait till start condition is generated and the bus becomes free */
      result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
      if ( result != kNoErr )
      {
        return kTimeoutErr;
      }
      if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
      {
        /* send the address of the requested device, wait for an acknowledge */
        I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), ( ( message->tx_buffer ) ? I2C_Direction_Transmitter : I2C_Direction_Receiver ) );
        
        /* wait till address gets sent and the direction bit is sent */
        if ( message->tx_buffer )
        {
          result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        }
        else
        {
          result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
        }
        if ( result != kNoErr )
        {
          continue;
        }
        else
        {
          break;
        }
      }
      else
      {
        //TODO
        /* send 10 bits of the address and wait for an acknowledge */
      }
    }
    if ( i == message->retries )
    {
      return kTimeoutErr;
    }
    
    if ( message->tx_buffer )
    {
      /* write transaction */
      
      const char* temp_ptr = (const char*) message->tx_buffer;
      /* send data to the i2c device */
      for ( i = 0; i < message->tx_length; i++ )
      {
        I2C_SendData( i2c_mapping[device->port].i2c, (uint8_t) temp_ptr[i] );
        
        /* wait till it actually gets transferred and acknowledged */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, I2C_FLAG_CHECK_TIMEOUT );
        if ( result != kNoErr )
        {
          return result;
        }
      }
    }
    else
    {
      /* read transaction */
      
      uint8_t* tmp_ptr = (uint8_t*) message->rx_buffer;
      if ( message->rx_length == 1 )
      {
        /* disable acknowledgement before we are going to receive a single byte */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
      }
      else
      {
        /* enable acknowledgement before we start receiving multiple bytes */
        I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
      }
      /* receive data from the i2c device */
      for ( i = 0; i < message->rx_length; i++ )
      {
        /* wait till something is in the i2c data register */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_RECEIVED, I2C_FLAG_CHECK_TIMEOUT );
        if ( result != kNoErr )
        {
          return result;
        }
        
        /* get data */
        tmp_ptr[i] = I2C_ReceiveData( i2c_mapping[device->port].i2c );
        if ( i == ( message->rx_length - 1 ) )
        {
          /* setup NACK for the last byte to be received */
          I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
        }
        else
        {
          /* setup an acknowledgement beforehand for every byte that is to be received */
          I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
        }
      }
    }
  }
  
  /* generate a stop condition */
  I2C_GenerateSTOP( i2c_mapping[device->port].i2c, ENABLE );
  return kNoErr;
}
#endif

OSStatus MicoI2cBuildTxMessage(mico_i2c_message_t* message, const void* tx_buffer, uint16_t  tx_buffer_length, uint16_t retries)
{
  if( ( message == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) )
  {
    return kParamErr;
  }
  memset(message, 0x00, sizeof(mico_i2c_message_t));
  message->tx_buffer = tx_buffer;
  message->combined = false;
  message->retries = retries;
  message->tx_length = tx_buffer_length;
  
  return kNoErr;
}

