wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverI2c.c
OSStatus MicoI2cBuildRxMessage(mico_i2c_message_t* message, void* rx_buffer, uint16_t  rx_buffer_length, uint16_t retries)
{
  if( ( message == 0 ) || ( rx_buffer == 0 ) || ( rx_buffer_length == 0 ) )
  {
    return kParamErr;
  }
  memset(message, 0x00, sizeof(mico_i2c_message_t));
  message->rx_buffer = rx_buffer;
  message->combined = false;
  message->retries = retries;
  message->rx_length = rx_buffer_length;
  
  return kNoErr;
}

OSStatus MicoI2cBuildCombinedMessage(mico_i2c_message_t* message, const void* tx_buffer, void* rx_buffer, uint16_t tx_buffer_length, uint16_t rx_buffer_length, uint16_t retries)
{
  if( ( message == 0 ) || ( rx_buffer == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) || ( rx_buffer_length == 0 ) )
  {
    return kParamErr;
  }
  memset(message, 0x00, sizeof(mico_i2c_message_t));
  message->rx_buffer = rx_buffer;
  message->tx_buffer = tx_buffer;
  message->combined = true;
  message->retries = retries;
  message->tx_length = tx_buffer_length;
  message->rx_length = rx_buffer_length;
  
  return kNoErr;
}

OSStatus MicoI2cTransfer( mico_i2c_device_t* device, mico_i2c_message_t* messages, uint16_t number_of_messages )
{
  OSStatus result;
  int i = 0;
  
  MicoMcuPowerSaveConfig(false);
  
  for( i=0; i < number_of_messages; i++ )
  {
#ifdef I2C_USE_DMA
    result = i2c_dma_transfer(device, &messages[i]);
    if( result != kNoErr )
    {
      MicoMcuPowerSaveConfig(true);
      return kGeneralErr;
    }
#else
    
    result = i2c_transfer_message_no_dma( device, &messages[i] );
    if( result != kNoErr )
    {
      MicoMcuPowerSaveConfig(true);
      return kGeneralErr;
    }
#endif
  }
  
  MicoMcuPowerSaveConfig(true);
  return kNoErr;
}

OSStatus MicoI2cFinalize( mico_i2c_device_t* device )
{
  MicoMcuPowerSaveConfig(false);
  
  /* Disable I2C peripheral clocks */
  RCC_APB1PeriphClockCmd( i2c_mapping[device->port].peripheral_clock_reg, DISABLE );
  
  /* Disable sda, scl gpio clocks */
  RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].pin_scl->peripheral_clock | i2c_mapping[device->port].pin_sda->peripheral_clock, DISABLE );
  
  /* Disable DMA */
#ifdef I2C_USE_DMA
  
  DMA_DeInit( i2c_mapping[device->port].rx_dma_stream );
  DMA_DeInit( i2c_mapping[device->port].tx_dma_stream );
  RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].tx_dma_peripheral_clock, DISABLE );
#endif
  
  MicoMcuPowerSaveConfig(true);
  
  return kNoErr;
}


